NicheHardware/nRF52-SkinT8e-EV/bluetooth/bluetooth.c

#include "bluetooth.h"
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "app_timer.h"
#include "ble_user_srv.h"
#include "ble_central_user_srv.h"
#include "ble_dfu.h"

#include "app_uart.h"
#include "app_util_platform.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

// 主机依赖
#include "ble_db_discovery.h"
// #include "app_util.h"
#include "ble_gap.h"
#include "nrf_ble_scan.h"
// ********

#include "build.h"

#define APP_BLE_CONN_CFG_TAG            2                                           /**< A tag identifying the SoftDevice BLE configuration. */

#define USER_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_ADV_FAST_INTERVAL            MSEC_TO_UNITS(100,UNIT_0_625_MS)         /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 25 ms.). */
#define APP_ADV_SLOW_INTERVAL            MSEC_TO_UNITS(250,UNIT_0_625_MS)        /**< Slow advertising interval (in units of 0.625 ms. This value corrsponds to 2 seconds). */
#define APP_ADV_FAST_TIMEOUT             10                                       /**< The duration of the fast advertising period (in seconds). */
#define APP_ADV_SLOW_TIMEOUT             0                                        /**< The duration of the slow advertising period (in seconds). */

#define MIN_CONN_MS 50
#define MAX_CONN_MS 100
#define CONN_TIMEOUT_MS 1000

#define MIN_CONN_INTERVAL                MSEC_TO_UNITS(MIN_CONN_MS, UNIT_1_25_MS)         	/**< Minimum connection interval (7.5 ms) */
#define MAX_CONN_INTERVAL                MSEC_TO_UNITS(MAX_CONN_MS, UNIT_1_25_MS)         	/**< Maximum connection interval (30 ms). */
#define SLAVE_LATENCY                    0                                        			/**< Slave latency. */
#define CONN_SUP_TIMEOUT                 MSEC_TO_UNITS(CONN_TIMEOUT_MS, UNIT_10_MS)         /**< Connection supervisory timeout (430 ms). */

#if (MAX_CONN_MS * (SLAVE_LATENCY+1) > 2000)
	#error "Connection parameter will not be accepted by iOS"
#elif (MAX_CONN_MS < 20)
	#error "Connection parameter will not be accepted by iOS"
#elif (MIN_CONN_MS + 20 > MAX_CONN_MS)
	#error "Connection parameter will not be accepted by iOS"
#elif (SLAVE_LATENCY > 4)
	#error "Connection parameter will not be accepted by iOS"
#elif (CONN_TIMEOUT_MS > 6000)
	#error "Connection parameter will not be accepted by iOS"
#elif (MAX_CONN_MS * (SLAVE_LATENCY + 1) * 3 >= CONN_TIMEOUT_MS)
	#error "Connection parameter will not be accepted by iOS"
#endif

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

// ---------------blackbox start------------------
#define BB_DEVICE_NAME                     "BlackBox"

#define BB_APP_ADV_FAST_INTERVAL            MSEC_TO_UNITS(75,UNIT_0_625_MS)
#define BB_APP_ADV_SLOW_INTERVAL            MSEC_TO_UNITS(125,UNIT_0_625_MS)
#define BB_APP_ADV_FAST_TIMEOUT             30
#define BB_APP_ADV_SLOW_TIMEOUT             0

#define BB_MIN_CONN_INTERVAL               MSEC_TO_UNITS(15, UNIT_1_25_MS)
#define BB_MAX_CONN_INTERVAL               MSEC_TO_UNITS(50, UNIT_1_25_MS)
#define BB_SLAVE_LATENCY                   0
#define BB_CONN_SUP_TIMEOUT                MSEC_TO_UNITS(2000, UNIT_10_MS)
// ---------------blackbox end------------------
#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

NRF_BLE_SCAN_DEF(m_scan);
BLE_DB_DISCOVERY_DEF(m_db_disc);

BLE_USER_DEF(m_user, NRF_SDH_BLE_TOTAL_LINK_COUNT);

BLE_CENTRAL_USER_DEF(m_ble_central);

NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */


static ble_uuid_t const m_user_uuid = {
	.uuid = BLE_UUID_USRV_SERVICE,
	.type = BLE_UUID_TYPE_BLE
};

static uint8_t m_gap_role     = BLE_GAP_ROLE_INVALID;       /**< BLE role for this connection, see @ref BLE_GAP_ROLES */
static uint16_t m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
	{BLE_UUID_USRV_SERVICE, USER_SERVICE_UUID_TYPE}
};

static void scan_start(void);
static void scan_stop(void);

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t* p_file_name)
{
	app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
	ret_code_t err_code = app_timer_init();
	APP_ERROR_CHECK(err_code);
}


// 48bit addr in LSB = bluetooth_addr.addr[6]
ble_gap_addr_t bluetooth_addr;

