NicheHardware/nRF52-SkinT8e-EV/bluetooth/bluetooth.c
/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
	uint32_t                err_code;
	ble_gap_conn_params_t   gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	err_code = sd_ble_gap_device_name_set(&sec_mode,
	                                      (const uint8_t*) DEVICE_NAME,
	                                      strlen(DEVICE_NAME));
	APP_ERROR_CHECK(err_code);

	err_code = sd_ble_gap_addr_get(&bluetooth_addr);
	APP_ERROR_CHECK(err_code);

	err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_HID);
	APP_ERROR_CHECK(err_code);

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
	gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
	gap_conn_params.slave_latency     = SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}

// blackbox ver
static void bb_gap_params_init(void)
{
	uint32_t                err_code;
	ble_gap_conn_params_t   gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	err_code = sd_ble_gap_device_name_set(&sec_mode,
	                                      (const uint8_t*) "BlackBox",
	                                      strlen("BlackBox"));
	APP_ERROR_CHECK(err_code);

	err_code = sd_ble_gap_addr_get(&bluetooth_addr);
	APP_ERROR_CHECK(err_code);

	err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_HID);
	APP_ERROR_CHECK(err_code);

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = BB_MIN_CONN_INTERVAL;
	gap_conn_params.max_conn_interval = BB_MAX_CONN_INTERVAL;
	gap_conn_params.slave_latency     = BB_SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout  = BB_CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}

static void user_data_handler(ble_user_evt_t* p_evt)
{
	if (p_evt->type == BLE_USER_EVT_RX_DATA) {
		static uint8_t p_data[256];
		static uint16_t p_length;
		static ble_user_data_t p_user_data;
		// uint32_t err_code;
		NRF_LOG_DEBUG("Received data from BLE.");
		NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
		memcpy(p_data, p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
		p_user_data.p_data = p_data;
		p_length = p_evt->params.rx_data.length;
		p_user_data.p_length = &p_length;
		uevt_bc(UEVT_BT_DATARECV, &p_user_data);
	}
}
/**@snippet [Handling the data received over BLE] */

static void disconnect(uint16_t conn_handle, void* p_context)
{
	UNUSED_PARAMETER(p_context);

	ret_code_t err_code = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	if (err_code != NRF_SUCCESS) {
		NRF_LOG_WARNING("Failed to disconnect connection. Connection handle: %d Error: %d", conn_handle, err_code);
	} else {
		NRF_LOG_DEBUG("Disconnected connection handle %d", conn_handle);
	}
}

static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
	switch (event) {
		case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE: {
			NRF_LOG_INFO("Device is preparing to enter bootloader mode.");

			// Prevent device from advertising on disconnect.
			// ble_adv_modes_config_t config;
			// advertising_config_get(&config);
			// config.ble_adv_on_disconnect_disabled = true;
			// ble_advertising_modes_config_set(&m_advertising, &config);

			// Disconnect all other bonded devices that currently are connected.
			// This is required to receive a service changed indication
			// on bootup after a successful (or aborted) Device Firmware Update.
			uint32_t conn_count = ble_conn_state_for_each_connected(disconnect, NULL);
			NRF_LOG_INFO("Disconnected %d links.", conn_count);
			break;
		}

		case BLE_DFU_EVT_BOOTLOADER_ENTER:
			// YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
			//           by delaying reset by reporting false in app_shutdown_handler
			NRF_LOG_INFO("Device will enter bootloader mode.");
			break;

		case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
			NRF_LOG_ERROR("Request to enter bootloader mode failed asynchroneously.");
			// YOUR_JOB: Take corrective measures to resolve the issue
			//           like calling APP_ERROR_CHECK to reset the device.
			break;

		case BLE_DFU_EVT_RESPONSE_SEND_ERROR:
			NRF_LOG_ERROR("Request to send a response to client failed.");
			// YOUR_JOB: Take corrective measures to resolve the issue
			//           like calling APP_ERROR_CHECK to reset the device.
			APP_ERROR_CHECK(false);
			break;

		default:
			NRF_LOG_ERROR("Unknown event from ble_dfu_buttonless.");
			break;
	}
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t* p_evt)
{
	uint32_t err_code;

	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
		APP_ERROR_CHECK(err_code);
	}
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
	APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
	uint32_t               err_code;
	ble_conn_params_init_t cp_init;

	memset(&cp_init, 0, sizeof(cp_init));

	cp_init.p_conn_params                  = NULL;
	cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
	cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
	cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
	cp_init.disconnect_on_fail             = false;
	cp_init.evt_handler                    = on_conn_params_evt;
	cp_init.error_handler                  = conn_params_error_handler;

