NicheHardware/nRF52-SkinT8e-EV/bluetooth/bluetooth.c
	err_code = ble_conn_params_init(&cp_init);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
	// Go to system-off mode (this function will not return; wakeup will cause a reset).
	uint32_t err_code = sd_power_system_off();
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
	// uint32_t err_code;

	switch (ble_adv_evt) {
		case BLE_ADV_EVT_FAST:
			break;
		case BLE_ADV_EVT_IDLE:
			sleep_mode_enter();
			break;
		default:
			break;
	}
}
static void ble_central_user_evt_handler(ble_central_user_t* p_ble_user, ble_central_user_evt_t const* p_ble_user_evt)
{
	ret_code_t err_code;

	switch (p_ble_user_evt->evt_type) {
		case BLE_USER_EVT_DISCOVERY_COMPLETE:
			NRF_LOG_INFO("Discovery complete.");
			err_code = ble_user_handles_assign(p_ble_user, p_ble_user_evt->conn_handle, &p_ble_user_evt->handles);
			APP_ERROR_CHECK(err_code);

			err_code = ble_user_tx_notif_enable(p_ble_user);
			APP_ERROR_CHECK(err_code);
			NRF_LOG_INFO("Connected to Corumi device.");
			break;

		case BLE_USER_EVT_TX_EVT:
			// ble_user_data_handler(p_ble_user, p_ble_user_evt->p_data, p_ble_user_evt->data_len);
			break;

		case BLE_USER_EVT_DISCONNECTED:
			NRF_LOG_INFO("Disconnected.");
			scan_start();
			break;
	}
}

bool is_valid_device(const ble_gap_evt_adv_report_t* p_adv_report)
{
	// uint8_t i,j,p = 0;
	if(p_adv_report->rssi < -88) {
		return false;
	}

	if(p_adv_report->peer_addr.addr[5] == 0xF1
	        && p_adv_report->peer_addr.addr[4] == 0x0C
	        && p_adv_report->peer_addr.addr[3] == 0x26
	        && p_adv_report->peer_addr.addr[2] == 0xEC
	        && p_adv_report->peer_addr.addr[1] == 0xF8
	        && p_adv_report->peer_addr.addr[0] == 0xF7) {
		NRF_LOG_RAW_INFO(" -> Found It!\n");
		return true;
	}
	// NRF_LOG_RAW_INFO("-->find_device:%02X:%02X:%02X:%02X:%02X:%02X",
	// 	p_adv_report->peer_addr.addr[0],
	// 	p_adv_report->peer_addr.addr[1],
	// 	p_adv_report->peer_addr.addr[2],
	// 	p_adv_report->peer_addr.addr[3],
	// 	p_adv_report->peer_addr.addr[4],
	// 	p_adv_report->peer_addr.addr[5]
	// );
	// NRF_LOG_RAW_INFO(" - rssi:%ddBm\n",
	//     p_adv_report->rssi
	// );
	// while(p<p_adv_report->data.len && p_adv_report->data.p_data[p+1]!=0xFF){
	//     p += p_adv_report->data.p_data[p+0]+1;
	// }
	// if(p>=p_adv_report->data.len){
	//     return false;
	// }else{
	//     if(p_adv_report->data.p_data[p+2]==0x50
	//         && p_adv_report->data.p_data[p+3]==0x50
	//         && p_adv_report->data.p_data[p+4]==0xDE
	//         && p_adv_report->data.p_data[p+5]==0xAD
	//         && p_adv_report->data.p_data[p+6]==0xBE
	//         && p_adv_report->data.p_data[p+7]==0xEF
	//         && p_adv_report->data.p_data[p+8]==0x00
	//         && p_adv_report->data.p_data[p+9]==0x01){
	//         return true;
	//     }
	// }
	return false;
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const* p_ble_evt, void* p_context)
{
	uint32_t err_code;
	ble_gap_evt_t const* p_gap_evt = &p_ble_evt->evt.gap_evt;

	switch (p_ble_evt->header.evt_id) {
		case BLE_GAP_EVT_ADV_REPORT: {
			const ble_gap_evt_adv_report_t* p_adv_report = &p_gap_evt->params.adv_report;
			// For readability.
			nrf_ble_scan_t*               p_scan_ctx  = &m_scan;
			ble_gap_addr_t const*         p_addr        = &p_adv_report->peer_addr;
			ble_gap_scan_params_t const* p_scan_params = &p_scan_ctx->scan_params;
			ble_gap_conn_params_t const* p_conn_params = &p_scan_ctx->conn_params;
			uint8_t                       con_cfg_tag   = p_scan_ctx->conn_cfg_tag;

			if(is_valid_device(p_adv_report) == true) {
				NRF_LOG_RAW_INFO("Scan stop\n");
				nrf_ble_scan_stop();
				// Establish connection.
				NRF_LOG_RAW_INFO("Start connect\n");
				err_code = sd_ble_gap_connect(p_addr,
				                              p_scan_params,
				                              p_conn_params,
				                              con_cfg_tag);
				NRF_LOG_RAW_INFO("Connecting\n");
				if (err_code != NRF_SUCCESS) {
					NRF_LOG_RAW_INFO("Err:[%d]\n", err_code);
					sd_ble_gap_connect_cancel();
					scan_start();
				}
			}
		}
		break; // BLE_GAP_EVT_ADV_REPORT
		case BLE_GAP_EVT_CONNECTED: {
			m_gap_role    = p_gap_evt->params.connected.role;
			if (m_gap_role == BLE_GAP_ROLE_PERIPH) {
				NRF_LOG_RAW_INFO("Connected\n");
				m_conn_handle = p_gap_evt->conn_handle;
				uevt_bc_e(UEVT_BT_CONN);
			} else if (m_gap_role == BLE_GAP_ROLE_CENTRAL) {
				// 如果是主机模式
				NRF_LOG_RAW_INFO("Connected to target\n");
				err_code = ble_user_handles_assign(&m_ble_central, p_gap_evt->conn_handle, NULL);
				APP_ERROR_CHECK(err_code);
				// g_conn_handle = p_gap_evt->conn_handle;
				// start discovery of services. The Client waits for a discovery result
				err_code = ble_db_discovery_start(&m_db_disc, p_gap_evt->conn_handle);
				APP_ERROR_CHECK(err_code);
			}
		}
		break;

		case BLE_GAP_EVT_DISCONNECTED:
			NRF_LOG_RAW_INFO("Disconnected\n");
			// LED indication will be changed when advertising starts.
			m_conn_handle = BLE_CONN_HANDLE_INVALID;
			uevt_bc_e(UEVT_BT_DISCONN);
			if (m_gap_role == BLE_GAP_ROLE_CENTRAL) {
				// 如果是主机模式则自动
				scan_start();
			}
			break;

		case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
			NRF_LOG_DEBUG("PHY update request.");
			ble_gap_phys_t const phys = {
				.rx_phys = BLE_GAP_PHY_AUTO,
				.tx_phys = BLE_GAP_PHY_AUTO,
			};
			err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
			APP_ERROR_CHECK(err_code);
		}
		break;

		case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
			// Pairing not supported
			err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
			// Accepting parameters requested by peer.
			err_code = sd_ble_gap_conn_param_update(p_ble_evt->evt.gap_evt.conn_handle,
			                                        &p_ble_evt->evt.gap_evt.params.conn_param_update_request.conn_params);
			APP_ERROR_CHECK(err_code);
			break;

