NicheHardware/nRF52-SkinT8e-EV/bluetooth/bluetooth.c
		case BLE_GAP_EVT_TIMEOUT:
			if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN) {
				NRF_LOG_RAW_INFO("Connection Request timed out.\n");
			}
			break;

		case BLE_GATTS_EVT_SYS_ATTR_MISSING:
			// No system attributes have been stored.
			err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTC_EVT_TIMEOUT:
			// Disconnect on GATT Client timeout event.
			err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
			                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTS_EVT_TIMEOUT:
			// Disconnect on GATT Server timeout event.
			err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
			                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			APP_ERROR_CHECK(err_code);
			break;

		default:
			// No implementation needed.
			break;
	}
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
	uint32_t           err_code;
	ble_user_init_t     user_init;
	ble_central_user_init_t central_user_init;
	ble_dfu_buttonless_init_t dfus_init = {0};

	memset(&user_init, 0, sizeof(user_init));
	user_init.data_handler = user_data_handler;
	err_code = ble_user_init(&m_user, &user_init);
	APP_ERROR_CHECK(err_code);

	memset(&central_user_init, 0, sizeof(central_user_init));
	central_user_init.data_handler = user_data_handler;
	central_user_init.evt_handler = ble_central_user_evt_handler;
	err_code = ble_central_user_init(&m_ble_central, &central_user_init);
	APP_ERROR_CHECK(err_code);

	// dfus_init.evt_handler = ble_dfu_evt_handler;
	// err_code = ble_dfu_buttonless_init(&dfus_init);
	// APP_ERROR_CHECK(err_code);

}

// blackbox ver
static void bb_services_init(void)
{
	uint32_t           err_code;
	ble_user_init_t     user_init;

	memset(&user_init, 0, sizeof(user_init));
	user_init.data_handler = user_data_handler;
	err_code = ble_user_init(&m_user, &user_init);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
	ret_code_t err_code;

	err_code = nrf_sdh_enable_request();
	APP_ERROR_CHECK(err_code);

	// Configure the BLE stack using the default settings.
	// Fetch the start address of the application RAM.
	uint32_t ram_start = 0;
	err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
	APP_ERROR_CHECK(err_code);

	// // Overwrite some of the default configurations for the BLE stack.
	// ble_cfg_t ble_cfg;

	// // MTU & DLE
	// memset(&ble_cfg, 0x00, sizeof(ble_cfg));
	// ble_cfg.conn_cfg.conn_cfg_tag                     = APP_BLE_CONN_CFG_TAG;
	// ble_cfg.conn_cfg.params.gap_conn_cfg.event_length = 10;
	// ble_cfg.conn_cfg.params.gap_conn_cfg.conn_count   = BLE_GAP_CONN_COUNT_DEFAULT;
	// err_code = sd_ble_cfg_set(BLE_CONN_CFG_GAP, &ble_cfg, ram_start);
	// APP_ERROR_CHECK(err_code);

	// Enable BLE stack.
	err_code = nrf_sdh_ble_enable(&ram_start);
	APP_ERROR_CHECK(err_code);

	// Register a handler for BLE events.
	NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t* p_gatt, nrf_ble_gatt_evt_t const* p_evt)
{
	if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)) {
		m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
		NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
	}
	NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
	              p_gatt->att_mtu_desired_central,
	              p_gatt->att_mtu_desired_periph);
}


/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
	ret_code_t err_code;

	err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
	APP_ERROR_CHECK(err_code);
	err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
	uint32_t               err_code;
	ble_advertising_init_t init;

	uint8_t manuf_data_raw[] = {
		0xDE, 0xAD,
		DEVICE_IDN,
		bluetooth_addr.addr[5],
		bluetooth_addr.addr[4],
		bluetooth_addr.addr[3],
		bluetooth_addr.addr[2],
		bluetooth_addr.addr[1],
		bluetooth_addr.addr[0],
	};
	ble_advdata_manuf_data_t manuf_data = {0x5050, {sizeof(manuf_data_raw), manuf_data_raw}};
	memset(&init, 0, sizeof(init));

	init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
	init.advdata.include_appearance = true;
	init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
	init.advdata.p_manuf_specific_data = &manuf_data;

	// init.advdata.uuids_more_available.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
	// init.advdata.uuids_more_available.p_uuids  = m_adv_uuids;

	init.config.ble_adv_fast_enabled  = true;
	init.config.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
	init.config.ble_adv_fast_timeout  = APP_ADV_FAST_TIMEOUT;
	init.config.ble_adv_slow_enabled  = true;
	init.config.ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
	init.config.ble_adv_slow_timeout  = APP_ADV_SLOW_TIMEOUT;
	init.evt_handler = on_adv_evt;

	err_code = ble_advertising_init(&m_advertising, &init);
	APP_ERROR_CHECK(err_code);

	ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

// blackbox ver
static void bb_advertising_init(void)
{
	uint32_t               err_code;
	ble_advertising_init_t init;

	uint8_t manuf_data_raw[] = {
		DEVICE_IDN,
		bluetooth_addr.addr[5],
		bluetooth_addr.addr[4],
		bluetooth_addr.addr[3],
		bluetooth_addr.addr[2],
		bluetooth_addr.addr[1],
		bluetooth_addr.addr[0],
	};
	ble_advdata_manuf_data_t manuf_data = {0x5050, {sizeof(manuf_data_raw), manuf_data_raw}};
	memset(&init, 0, sizeof(init));

	init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
	init.advdata.include_appearance = true;
	init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
	init.advdata.p_manuf_specific_data = &manuf_data;

	init.config.ble_adv_fast_enabled  = true;
	init.config.ble_adv_fast_interval = BB_APP_ADV_FAST_INTERVAL;
	init.config.ble_adv_fast_timeout  = BB_APP_ADV_FAST_TIMEOUT;
	init.config.ble_adv_slow_enabled  = true;
	init.config.ble_adv_slow_interval = BB_APP_ADV_SLOW_INTERVAL;
	init.config.ble_adv_slow_timeout  = BB_APP_ADV_SLOW_TIMEOUT;
	init.evt_handler = on_adv_evt;

	err_code = ble_advertising_init(&m_advertising, &init);
	APP_ERROR_CHECK(err_code);

	ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

static void scan_evt_handler(scan_evt_t const* p_scan_evt)
{
	ret_code_t err_code;

	switch(p_scan_evt->scan_evt_id) {
		case NRF_BLE_SCAN_EVT_CONNECTING_ERROR: {
			err_code = p_scan_evt->params.connecting_err.err_code;
			APP_ERROR_CHECK(err_code);
		}
		break;

		case NRF_BLE_SCAN_EVT_CONNECTED: {
			ble_gap_evt_connected_t const* p_connected =
			    p_scan_evt->params.connected.p_connected;
			// Scan is automatically stopped by the connection.
			NRF_LOG_RAW_INFO("Connecting to target %02x:%02x:%02x:%02x:%02x:%02x\n",
			                 p_connected->peer_addr.addr[0],
			                 p_connected->peer_addr.addr[1],
			                 p_connected->peer_addr.addr[2],
			                 p_connected->peer_addr.addr[3],
			                 p_connected->peer_addr.addr[4],
			                 p_connected->peer_addr.addr[5]
			                );
		}
		break;

		case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT: {
			NRF_LOG_RAW_INFO("Scan timed out.\n");
			scan_start();
		}
		break;

		default:
			break;
	}
}

static void scan_init(void)
{
	ret_code_t          err_code;
	nrf_ble_scan_init_t init_scan;

