NicheHardware/nRF52-SkinT8e-EV/bluetooth/bluetooth.c
	memset(&init_scan, 0, sizeof(init_scan));

	init_scan.connect_if_match = true;
	init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

	err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
	APP_ERROR_CHECK(err_code);

	// err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, scan_name);
	// APP_ERROR_CHECK(err_code);

	// err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
	// APP_ERROR_CHECK(err_code);
}
static void db_disc_handler(ble_db_discovery_evt_t* p_evt)
{
	ble_user_on_db_disc_evt(&m_ble_central, p_evt);
}

static void db_discovery_init(void)
{
	ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
	APP_ERROR_CHECK(err_code);
	err_code = ble_db_discovery_evt_register(&m_user_uuid);
	APP_ERROR_CHECK(err_code);
}

static void scan_start(void)
{
	ret_code_t ret;
	ret = nrf_ble_scan_start(&m_scan);
	APP_ERROR_CHECK(ret);
}
static void scan_stop(void)
{
	nrf_ble_scan_stop();
}



/**@brief Function for starting advertising.
 */
void ble_adv_start(void)
{
	uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(err_code);
	uevt_bc_e(UEVT_BT_ADV_START);
}

void ble_adv_stop(void)
{
	ret_code_t ret = sd_ble_gap_adv_stop(m_advertising.adv_handle);
	if(ret == 0) {
		NRF_LOG_RAW_INFO("Stop advertising.\n");
		uevt_bc_e(UEVT_BT_ADV_STOP);
	}
}

void bb_bluetooth_init(void)
{
	timers_init();
	ble_stack_init();
	bb_gap_params_init();
	gatt_init();
	bb_services_init();
	bb_advertising_init();
	conn_params_init();
}

void bluetooth_init(void)
{
	timers_init();
	db_discovery_init();	// central
	ble_stack_init();
	gap_params_init();
	gatt_init();
	services_init();
	scan_init();	// central
	advertising_init();
	conn_params_init();
	uevt_bc_e(UEVT_BT_INIT);
}

void bt_on_uevt_handler(uevt_t* evt)
{
	// uint32_t err_code;
	switch(evt->evt_id) {
		case UEVT_BT_CTL_INIT:
			bluetooth_init();
			break;
		case UEVT_BT_CTL_ADV_ON:
			ble_adv_start();
			break;
		case UEVT_BT_CTL_ADV_OFF:
			ble_adv_stop();
			break;
		case UEVT_BT_CTL_DISCONN:
			if(m_conn_handle != BLE_CONN_HANDLE_INVALID) {
				disconnect(m_conn_handle, NULL);
			}
			break;
		case UEVT_BT_CTL_DATASEND:
			ble_user_send(&m_user,
			              ((ble_user_data_t*)(evt->content))->p_data,
			              ((ble_user_data_t*)(evt->content))->p_length,
			              m_conn_handle);
			break;
		case UEVT_BT_CTL_CENTRAL_DATASEND:
			ble_central_user_send(&m_ble_central,
			                      ((ble_user_data_t*)(evt->content))->p_data,
			                      ((ble_user_data_t*)(evt->content))->p_length
			                     );
			break;
		case UEVT_BT_CTL_RSSI_START:
			sd_ble_gap_rssi_start(m_conn_handle, 5, 3);
			break;
		case UEVT_BT_CTL_RSSI_STOP:
			sd_ble_gap_rssi_stop(m_conn_handle);
			break;
		case UEVT_BT_CTL_RSSI_GET: {
			static ble_rssi_t rssi;
			if(m_conn_handle != BLE_CONN_HANDLE_INVALID) {
				if(sd_ble_gap_rssi_get(m_conn_handle, &(rssi.rssi), &(rssi.ch)) == NRF_SUCCESS) {
					uevt_bc(UEVT_BT_RSSI, &rssi);
				}
			}
		}
		break;

		case UEVT_BT_CTL_SCAN_ON:
			scan_start();
			break;
		case UEVT_BT_CTL_SCAN_OFF:
			scan_stop();
			break;
	}
}
